victorpv/Arduino_STM32/STM32F1/libraries/MapleCoOS116/examples/coos_wav_player_setModule2/TFT_ILI9163C.cpp
#include "TFT_ILI9163C.h"
#include <limits.h>
#include "pins_arduino.h"
#include "wiring_private.h"
#include <SPI.h>

SPIClass tftSPI(2);
//#define tftSPI SPI

//constructors
TFT_ILI9163C::TFT_ILI9163C(uint8_t cspin,uint8_t dcpin,uint8_t rstpin) : Adafruit_GFX(_TFTWIDTH,_TFTHEIGHT){
	_cs   = cspin;
	_rs   = dcpin;
	_rst  = rstpin;
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
	#else
	_sid  = _sclk = 0;
	#endif
}


TFT_ILI9163C::TFT_ILI9163C(uint8_t CS, uint8_t DC) : Adafruit_GFX(_TFTWIDTH, _TFTHEIGHT) {
	_cs   = CS;
	_rs   = DC;
	_rst  = 0;
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
	#else
	_sid  = _sclk = 0;
	#endif
}

//Arduino Uno, Leonardo, Mega, Teensy 2.0, etc
#ifdef __AVR__

inline void TFT_ILI9163C::spiwrite(uint8_t c){
    SPDR = c;
    while(!(SPSR & _BV(SPIF)));
}

void TFT_ILI9163C::writecommand(uint8_t c){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport &= ~rspinmask;//low
	*csport &= ~cspinmask;//low
	spiwrite(c);
	*csport |= cspinmask;//hi
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
}

void TFT_ILI9163C::writedata(uint8_t c){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport |=  rspinmask;
	*csport &= ~cspinmask;
	spiwrite(c);
	*csport |= cspinmask;
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
} 

void TFT_ILI9163C::writedata16(uint16_t d){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport |=  rspinmask;
	*csport &= ~cspinmask;
	spiwrite(d >> 8);
	spiwrite(d);
	*csport |= cspinmask;
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
} 

void TFT_ILI9163C::setBitrate(uint32_t n){
	#if !defined (SPI_HAS_TRANSACTION)
	if (n >= 8000000) {
		tftSPI.setClockDivider(SPI_CLOCK_DIV2);
	} else if (n >= 4000000) {
		tftSPI.setClockDivider(SPI_CLOCK_DIV4);
	} else if (n >= 2000000) {
		tftSPI.setClockDivider(SPI_CLOCK_DIV8);
	} else {
		tftSPI.setClockDivider(SPI_CLOCK_DIV16);
	}
	#endif
}
#elif defined(__SAM3X8E__)
// Arduino Due

inline void TFT_ILI9163C::spiwrite(uint8_t c){
    tftSPI.transfer(c);
}

void TFT_ILI9163C::writecommand(uint8_t c){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	rsport->PIO_CODR |=  rspinmask;//LO
	csport->PIO_CODR  |=  cspinmask;//LO
	spiwrite(c);
	csport->PIO_SODR  |=  cspinmask;//HI
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
}

void TFT_ILI9163C::writedata(uint8_t c){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	rsport->PIO_SODR |=  rspinmask;//HI
	csport->PIO_CODR  |=  cspinmask;//LO
	spiwrite(c);
	csport->PIO_SODR  |=  cspinmask;//HI
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
} 

void TFT_ILI9163C::writedata16(uint16_t d){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	rsport->PIO_SODR |=  rspinmask;//HI
	csport->PIO_CODR  |=  cspinmask;//LO
	spiwrite(d >> 8);
	spiwrite(d);
	csport->PIO_SODR  |=  cspinmask;//HI
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
}


void TFT_ILI9163C::setBitrate(uint32_t n){
	#if !defined (SPI_HAS_TRANSACTION)
	uint32_t divider=1;
	while (divider < 255) {
		if (n >= 84000000 / divider) break;
		divider = divider - 1;
	}
	tftSPI.setClockDivider(divider);
	#endif
}

#elif defined(__STM32F1__)
// Maple & Maple mini

inline void TFT_ILI9163C::spiwrite(uint8_t c){
    tftSPI.write(c);
}

void TFT_ILI9163C::writecommand(uint8_t c){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport &= ~rspinmask;//low
	*csport &= ~cspinmask;//low
	spiwrite(c);
	*csport |= cspinmask;//hi
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
}

void TFT_ILI9163C::writedata(uint8_t c){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport |=  rspinmask;
	*csport &= ~cspinmask;
#if defined SPI_16BIT
	tftSPI.setDataSize (0);
#endif
	spiwrite(c);
#if defined SPI_16BIT
	tftSPI.setDataSize (SPI_CR1_DFF);
#endif
	*csport |= cspinmask;
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
} 

void TFT_ILI9163C::writedata16(uint16_t d){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport |=  rspinmask;
	*csport &= ~cspinmask;
#if defined SPI_16BIT
	tftSPI.write(d);
#else
	spiwrite(d >> 8);
	spiwrite(d);
#endif
	*csport |= cspinmask;
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
} 

void TFT_ILI9163C::setBitrate(uint32_t n){
	#if !defined (SPI_HAS_TRANSACTION)
	if (n >= 8000000) {
		tftSPI.setClockDivider(SPI_CLOCK_DIV2);
	} else if (n >= 4000000) {
		tftSPI.setClockDivider(SPI_CLOCK_DIV4);
	} else if (n >= 2000000) {
		tftSPI.setClockDivider(SPI_CLOCK_DIV8);
	} else {
		tftSPI.setClockDivider(SPI_CLOCK_DIV16);
	}
	#endif
}

///////////////
#elif defined(__MK20DX128__) || defined(__MK20DX256__)
//Teensy 3.0 & 3.1  

void TFT_ILI9163C::setBitrate(uint32_t n){
	//nop
}

#endif //#if defined(TEENSY3.x)


void TFT_ILI9163C::begin(void) {
	sleep = 0;
#if defined (__AVR__) || (__STM32F1__)
	pinMode(_rs, OUTPUT);
	pinMode(_cs, OUTPUT);
	csport    = portOutputRegister(digitalPinToPort(_cs));
	rsport    = portOutputRegister(digitalPinToPort(_rs));
	cspinmask = digitalPinToBitMask(_cs);
	rspinmask = digitalPinToBitMask(_rs);
    tftSPI.begin();
	#if defined SPI_16BIT
	  tftSPI.setDataSize (SPI_CR1_DFF);
	#endif
	#if !defined (SPI_HAS_TRANSACTION)
    tftSPI.setClockDivider(SPI_CLOCK_DIV2); // 8 MHz
    tftSPI.setBitOrder(MSBFIRST);
    tftSPI.setDataMode(SPI_MODE0);
	#endif
	// toggle RST low to reset; CS low so it'll listen to us
	*csport &= ~cspinmask;
#elif defined(__SAM3X8E__)
	pinMode(_rs, OUTPUT);
	pinMode(_cs, OUTPUT);
	csport    = digitalPinToPort(_cs);
	rsport    = digitalPinToPort(_rs);
	cspinmask = digitalPinToBitMask(_cs);
	rspinmask = digitalPinToBitMask(_rs);
    tftSPI.begin();
	#if !defined (SPI_HAS_TRANSACTION)
    tftSPI.setClockDivider(11); // 8 MHz
    tftSPI.setBitOrder(MSBFIRST);
    tftSPI.setDataMode(SPI_MODE0);
	#endif
	// toggle RST low to reset; CS low so it'll listen to us
	csport ->PIO_CODR  |=  cspinmask; // Set control bits to LOW (idle)
#elif defined(__MK20DX128__) || defined(__MK20DX256__)
	tftSPI.begin();
	if (tftSPI.pinIsChipSelect(_cs, _rs)) {
		pcs_data = tftSPI.setCS(_cs);
		pcs_command = pcs_data | tftSPI.setCS(_rs);
	} else {
		pcs_data = 0;
		pcs_command = 0;
		return;
	}
#endif
	if (_rst != 0) {
		pinMode(_rst, OUTPUT);
		digitalWrite(_rst, HIGH);
		delay(500);
		digitalWrite(_rst, LOW);
		delay(500);
		digitalWrite(_rst, HIGH);
		delay(500);
	}

