victorpv/Arduino_STM32/STM32F1/libraries/MapleCoOS116/examples/coos_wav_player_setModule2/TFT_ILI9163C.cpp
	delay(1);
	#endif
	fillScreen(BLACK);
}

/*
Colorspace selection:
0: RGB
1: GBR
*/
void TFT_ILI9163C::colorSpace(uint8_t cspace) {
	if (cspace < 1){
		bitClear(_Mactrl_Data,3);
	} else {
		bitSet(_Mactrl_Data,3);
	}
}

void TFT_ILI9163C::invertDisplay(boolean i) {
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
		writecommand_last(i ? CMD_DINVON : CMD_DINVOF);
		tftSPI.endTransaction();
	#else
		writecommand(i ? CMD_DINVON : CMD_DINVOF);
	#endif
}

void TFT_ILI9163C::display(boolean onOff) {
	if (onOff){
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
			tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
			writecommand_last(CMD_DISPON);
			endProc();
		#else
			writecommand(CMD_DISPON);
		#endif
	} else {
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
			tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
			writecommand_last(CMD_DISPOFF);
			endProc();
		#else
			writecommand(CMD_DISPOFF);
		#endif
	}
}

void TFT_ILI9163C::idleMode(boolean onOff) {
	if (onOff){
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
			tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
			writecommand_last(CMD_IDLEON);
			endProc();
		#else
			writecommand(CMD_IDLEON);
		#endif
	} else {
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
			tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
			writecommand_last(CMD_IDLEOF);
			endProc();
		#else
			writecommand(CMD_IDLEOF);
		#endif
	}
}

void TFT_ILI9163C::sleepMode(boolean mode) {
	if (mode){
		if (sleep == 1) return;//already sleeping
		sleep = 1;
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
			tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
			writecommand_last(CMD_SLPIN);
			endProc();
		#else
			writecommand(CMD_SLPIN);
		#endif
		delay(5);//needed
	} else {
		if (sleep == 0) return; //Already awake
		sleep = 0;
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
			tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
			writecommand_last(CMD_SLPOUT);
			endProc();
		#else
			writecommand(CMD_SLPOUT);
		#endif
		delay(120);//needed
	}
}

void TFT_ILI9163C::defineScrollArea(uint16_t tfa, uint16_t bfa){
    tfa += __OFFSET;
    int16_t vsa = _GRAMHEIGH - tfa - bfa;
    if (vsa >= 0) {
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
		tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
        writecommand_cont(CMD_VSCLLDEF);
        writedata16_cont(tfa);
        writedata16_cont(vsa);
        writedata16_last(bfa);
		endProc();
		#else
        writecommand(CMD_VSCLLDEF);
        writedata16(tfa);
        writedata16(vsa);
        writedata16(bfa);
		#endif
    }
}

void TFT_ILI9163C::scroll(uint16_t adrs) {
	if (adrs <= _GRAMHEIGH) {
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
		writecommand_cont(CMD_VSSTADRS);
		writedata16_last(adrs + __OFFSET);
		endProc();
	#else
		writecommand(CMD_VSSTADRS);
		writedata16(adrs + __OFFSET);
	#endif
	}
}


//corrected! v3
void TFT_ILI9163C::clearScreen(uint16_t color) {
	int px;
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
		//writecommand_cont(CMD_RAMWR);
		_setAddrWindow(0x00,0x00,_GRAMWIDTH,_GRAMHEIGH);
		for (px = 0;px < _GRAMSIZE; px++){
			writedata16_cont(color);
		}
		writecommand_last(CMD_NOP);
		endProc();
	#elif defined(SPI_MODE_DMA)	
		fillScanline(color, _GRAMHEIGH);
		setAddr(0x00,0x00,_GRAMWIDTH,_GRAMHEIGH);//go home
		*rsport |=  rspinmask;
		*csport &= ~cspinmask;
		for (px = 0; px < _GRAMWIDTH; px++){
			writeScanline(_GRAMHEIGH);
		}
		*csport |= cspinmask;

	#else
		//writecommand(CMD_RAMWR);
		setAddr(0x00,0x00,_GRAMWIDTH,_GRAMHEIGH);//go home
		for (px = 0;px < _GRAMSIZE; px++){
			writedata16(color);
		}
	#endif
}

void TFT_ILI9163C::startPushData(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {
	setAddr(x0,y0,x1,y1);
}

void TFT_ILI9163C::pushData(uint16_t color) {
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		writedata16_cont(color);
	#else
		writedata16(color);
	#endif
}


void TFT_ILI9163C::endPushData() {
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		writecommand_last(CMD_NOP);
		endProc();
	#endif
}


void TFT_ILI9163C::pushColor(uint16_t color) {
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
		writedata16_last(color);
		endProc();
	#else
		writedata16(color);
	#endif
}
	
void TFT_ILI9163C::writeScreen24(const uint32_t *bitmap,uint16_t size) {
	uint16_t color;
	int px;
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		writecommand_cont(CMD_RAMWR);
		for (px = 0;px < size; px++){//16384
			color = Color24To565(bitmap[px]);
			writedata16_cont(color);
		}
		_setAddrWindow(0x00,0x00,_GRAMWIDTH,_GRAMHEIGH);//home
		endProc();
	#else
	
		writecommand(CMD_RAMWR);
		for (px = 0;px < size; px++){
			color = Color24To565(bitmap[px]);
			writedata16(color);
		}
		homeAddress();
	#endif
}

void TFT_ILI9163C::homeAddress() {
	setAddrWindow(0x00,0x00,_GRAMWIDTH,_GRAMHEIGH);
}



void TFT_ILI9163C::setCursor(int16_t x, int16_t y) {
	if (boundaryCheck(x,y)) return;
	setAddrWindow(0x00,0x00,x,y);
	cursor_x = x;
	cursor_y = y;
}



void TFT_ILI9163C::drawPixel(int16_t x, int16_t y, uint16_t color) {
	if (boundaryCheck(x,y)) return;
	if ((x < 0) || (y < 0)) return;
	setAddr(x,y,x+1,y+1);
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		writedata16_last(color);
		endProc();
	#else
		writedata16(color);
	#endif
}



void TFT_ILI9163C::endProc(void){
	#if defined(__MK20DX128__) || defined(__MK20DX256__)
		tftSPI.endTransaction();
	#endif
}


void TFT_ILI9163C::drawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color) {
	// Rudimentary clipping
	if (boundaryCheck(x,y)) return;
	if (((y + h) - 1) >= _height) h = _height-y;
	if (h < 2 ) {
		drawPixel(x, y, color);
		return;
	}
	setAddr(x,y,x,(y+h)-1);
	#if !defined SPI_MODE_DMA
	while (h-- > 1) {
		#if defined(__MK20DX128__) || defined(__MK20DX256__)
		if (h == 0){
			writedata16_last(color);
		} else {
			writedata16_cont(color);
		}
		#else
			writedata16(color);
		#endif
	}

	endProc();
	#else //SPI_MODE_DMA
	fillScanline(color, h);
	*rsport |=  rspinmask;
	*csport &= ~cspinmask;
	writeScanline(h);
	*csport |= cspinmask;
	#endif
}

