victorpv/Arduino_STM32/STM32F1/libraries/MapleCoOS116/examples/coos_wav_player_setModule2/TFT_ILI9163C.cpp
#if SPI_MODE_DMA
void TFT_ILI9163C::drawLine(int16_t x0, int16_t y0,int16_t x1, int16_t y1, uint16_t color)
{
	if (y0 == y1) {
		if (x1 > x0) {
			drawFastHLine(x0, y0, x1 - x0 + 1, color);
		}
		else if (x1 < x0) {
			drawFastHLine(x1, y0, x0 - x1 + 1, color);
		}
		else {
			drawPixel(x0, y0, color);
		}
		return;
	}
	else if (x0 == x1) {
		if (y1 > y0) {
			drawFastVLine(x0, y0, y1 - y0 + 1, color);
		}
		else {
			drawFastVLine(x0, y1, y0 - y1 + 1, color);
		}
		return;
	}

	bool steep = abs(y1 - y0) > abs(x1 - x0);
	if (steep) {
		swap(x0, y0);
		swap(x1, y1);
	}
	if (x0 > x1) {
		swap(x0, x1);
		swap(y0, y1);
	}

	int16_t dx, dy;
	dx = x1 - x0;
	dy = abs(y1 - y0);

	int16_t err = dx / 2;
	int16_t ystep;

	if (y0 < y1) {
		ystep = 1;
	}
	else {
		ystep = -1;
	}

	int16_t xbegin = x0;
	fillScanline(color, _GRAMHEIGH);
	*csport &= ~cspinmask;
	if (steep) {
		for (; x0 <= x1; x0++) {
			err -= dy;
			if (err < 0) {
				int16_t len = x0 - xbegin;
				if (len) {
					//drawFastVLine (y0, xbegin, len + 1, color);
					writeVLine_cont_noCS_noFill(y0, xbegin, len + 1);
				}
				else {
					//drawPixel(x0, y0, color);
					writePixel_cont_noCS(y0, x0, color);
				}
				xbegin = x0 + 1;
				y0 += ystep;
				err += dx;
			}
		}
		if (x0 > xbegin + 1) {
			writeVLine_cont_noCS_noFill(y0, xbegin, x0 - xbegin);
		}

	}
	else {
		for (; x0 <= x1; x0++) {
			err -= dy;
			if (err < 0) {
				int16_t len = x0 - xbegin;
				if (len) {
					//drawFastVLine(xbegin, y0, len + 1, color);
					writeHLine_cont_noCS_noFill(xbegin, y0, len + 1);
				}
				else {
					//drawPixel(x0, y0, color);
					writePixel_cont_noCS(x0, y0, color);
				}
				xbegin = x0 + 1;
				y0 += ystep;
				err += dx;
			}
		}
		if (x0 > xbegin + 1) {
			writeHLine_cont_noCS_noFill(xbegin, y0, x0 - xbegin);
		}
	}
	*csport |= cspinmask;
}

void TFT_ILI9163C::writePixel_cont_noCS(int16_t x, int16_t y, uint16_t color)
{
    if (boundaryCheck(x,y)) return;
	if ((x < 0) || (y < 0)) return;
	setAddrWindow_cont(x,y,x+1,y+1);
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport |=  rspinmask;
	#if defined SPI_16BIT
	tftSPI.write(color);
	#else
	spiwrite(color >> 8);
	spiwrite(color);
	#endif
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
}

void TFT_ILI9163C::writeVLine_cont_noCS_noFill(int16_t x, int16_t y, int16_t h)
{
	// Rudimentary clipping
	if (boundaryCheck(x,y)) return;
	if ((x < 0) || (y < 0)) return;
	if (((y + h) - 1) >= _height) h = _height-y;
	setAddrWindow_cont(x,y,x,(y+h)-1);
	*rsport |=  rspinmask;
	writeScanline(h); // send 2 bytes per pixel
}

void TFT_ILI9163C::writeHLine_cont_noCS_noFill(int16_t x, int16_t y, int16_t w)
{
	// Rudimentary clipping
	if (boundaryCheck(x,y)) return;
	if ((x < 0) || (y < 0)) return;
	if (((x+w) - 1) >= _width)  w = _width-x;
	setAddrWindow_cont(x,y,(x+w)-1,y);
	*rsport |=  rspinmask;
	writeScanline(w);
}

void TFT_ILI9163C::setAddrWindow_cont(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {
	writecommand_cont(CMD_CLMADRS); // Column
	if (rotation == 0 || rotation > 1){
		writedata16_cont(x0);
		writedata16_cont(x1);
	} else {
		writedata16_cont(x0 + __OFFSET);
		writedata16_cont(x1 + __OFFSET);
	}
	writecommand_cont(CMD_PGEADRS); // Page
	if (rotation == 0){
		writedata16_cont(y0 + __OFFSET);
		writedata16_cont(y1 + __OFFSET);
	} else {
		writedata16_cont(y0);
		writedata16_cont(y1);
	}
	writecommand_cont(CMD_RAMWR); //Into RAM
}

void TFT_ILI9163C::writedata16_cont(uint16_t d){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport |=  rspinmask;
#if defined SPI_16BIT
	tftSPI.write(d);
#else
	spiwrite(d >> 8);
	spiwrite(d);
#endif
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
} 

void TFT_ILI9163C::writecommand_cont(uint8_t c){
	#ifdef SPI_HAS_TRANSACTION
    tftSPI.beginTransaction(SPISettings(SPICLOCK, MSBFIRST, SPI_MODE0));
    #endif
	*rsport &= ~rspinmask;//low
	spiwrite(c);
	#ifdef SPI_HAS_TRANSACTION
	tftSPI.endTransaction();
	#endif
}

void TFT_ILI9163C::drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color){
	fillScanline(color, _GRAMHEIGH);
	*csport &= ~cspinmask;
	writeHLine_cont_noCS_noFill(x, y, w);
	writeHLine_cont_noCS_noFill(x, y+h-1, w);
	writeVLine_cont_noCS_noFill(x, y, h);
	writeVLine_cont_noCS_noFill(x+w-1, y, h);
	*csport |= cspinmask;
}

void TFT_ILI9163C::drawCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color)
{
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;
	*csport &= ~cspinmask;
	writePixel_cont_noCS(x0, y0 + r, color);
	writePixel_cont_noCS(x0, y0 - r, color);
	writePixel_cont_noCS(x0 + r, y0, color);
	writePixel_cont_noCS(x0 - r, y0, color);
	#if SPEED_UP
	if (r<6){
	#endif
	while (x < y) {
		if (f >= 0) {
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;

		writePixel_cont_noCS(x0 + x, y0 + y, color);
		writePixel_cont_noCS(x0 - x, y0 + y, color);
		writePixel_cont_noCS(x0 + x, y0 - y, color);
		writePixel_cont_noCS(x0 - x, y0 - y, color);
		writePixel_cont_noCS(x0 + y, y0 + x, color);
		writePixel_cont_noCS(x0 - y, y0 + x, color);
		writePixel_cont_noCS(x0 + y, y0 - x, color);
		writePixel_cont_noCS(x0 - y, y0 - x, color);
	}
	#if SPEED_UP
	}
	else {
	fillScanline(color, _GRAMHEIGH);
	int16_t xi = x;
	int16_t yi = y;
	int16_t w = 0;
	while (x < y) {
		if (f >= 0) {
			y--;
			ddF_y += 2;
			f += ddF_y;
		}
		x++;
		ddF_x += 2;
		f += ddF_x;
		if (y < yi){
			w = x - xi;
			if (w > 0){
			writeHLine_cont_noCS_noFill(x0 + xi, y0 + yi, w);
			writeHLine_cont_noCS_noFill(x0 - x + 1, y0 + yi, w);
			writeHLine_cont_noCS_noFill(x0 + xi, y0 - yi, w);
			writeHLine_cont_noCS_noFill(x0 - x + 1, y0 - yi, w);
			writeVLine_cont_noCS_noFill(x0 + yi, y0 + xi, w);
			writeVLine_cont_noCS_noFill(x0 - yi, y0 + xi, w);
			writeVLine_cont_noCS_noFill(x0 + yi, y0 - x + 1, w);
			writeVLine_cont_noCS_noFill(x0 - yi, y0 - x + 1, w);
			}
			else {
			writePixel_cont_noCS(x0 + x, y0 + y, color);
			writePixel_cont_noCS(x0 - x, y0 + y, color);
			writePixel_cont_noCS(x0 + x, y0 - y, color);
			writePixel_cont_noCS(x0 - x, y0 - y, color);
			writePixel_cont_noCS(x0 + y, y0 + x, color);
			writePixel_cont_noCS(x0 - y, y0 + x, color);
			writePixel_cont_noCS(x0 + y, y0 - x, color);
			writePixel_cont_noCS(x0 - y, y0 - x, color);
			}
		yi = y;
		xi = x;
		}
	}
		writePixel_cont_noCS(x0 + x, y0 + y, color);
		writePixel_cont_noCS(x0 - x, y0 + y, color);
		writePixel_cont_noCS(x0 + x, y0 - y, color);
		writePixel_cont_noCS(x0 - x, y0 - y, color);
		writePixel_cont_noCS(x0 + y, y0 + x, color);
		writePixel_cont_noCS(x0 - y, y0 + x, color);
		writePixel_cont_noCS(x0 + y, y0 - x, color);
		writePixel_cont_noCS(x0 - y, y0 - x, color);
	}
	#endif
	*csport |= cspinmask;
}

// Sets first n pixels in scanline buffer to the specified color
//    __attribute__((always_inline))
void TFT_ILI9163C::fillScanline(uint16_t color, size_t n) {
#if defined SPI_16BIT
	//color = (color << 8) | (color >> 8); 
//    for (uint16_t i = 0; i < n; i ++)
//    {
      _scanlineBuffer16[0] = color;
//    }
#else
    _hiByte = highByte(color);
    _loByte = lowByte(color);
    for (uint16_t i = 0; i < (n << 1); i += 2)
    {
      _scanlineBuffer8[i] = _hiByte;
      _scanlineBuffer8[i + 1] = _loByte;
    }
#endif
}

// Enables CS, sets DC and writes n-bytes from the scanline buffer via DMA
// Does not disable CS
//    inline __attribute__((always_inline))
void TFT_ILI9163C::writeScanline(size_t n) {
	if (n == 0) return;
#if defined SPI_16BIT
    tftSPI.dmaSend(_scanlineBuffer16, n, 0);	// each pixel is one halfword. circular mode
#else
    tftSPI.dmaSend(_scanlineBuffer8, n << 1);	// each pixel is 2 bytes
#endif
}

void TFT_ILI9163C::drawQuad(int16_t x0, int16_t y0,int16_t x1, int16_t y1,int16_t x2, int16_t y2,int16_t x3, int16_t y3, uint16_t color)  
{ 
	drawLine(x0, y0, x1, y1, color);//low 1 
	drawLine(x1, y1, x2, y2, color);//high 1 
	drawLine(x2, y2, x3, y3, color);//high 2 
	drawLine(x3, y3, x0, y0, color);//low 2 
} 

void TFT_ILI9163C::fillQuad ( int16_t x0, int16_t y0,int16_t x1, int16_t y1,int16_t x2, int16_t y2, int16_t x3, int16_t y3, uint16_t color)  
{ 
    fillTriangle(x0,y0,x1,y1,x2,y2,color); 
    fillTriangle(x0,y0,x2,y2,x3,y3,color); 
} 

#endif



